[
  {
    "type": "Colegio",
    "institution": "Etec Jardim Ângela",
    "date": "2018 - 2021",
    "course": "Ensino médio integrado com técnico em TI",
    "description":"Na ETEC Jardim Angela, aprendi toda a base que precisava para começar e entender o mundo da programação. Aprendi todo o processo de criação de um projeto real, como fazer banco de dados, aplicações desktop com Java, aplicações web com HTML, CSS, PHP e JavaScript. Meu TCC foi desenvolvido para uma livraria fictícia. Elaborei toda a documentação do projeto, incluindo a estrutura do banco de dados e as funcionalidades da aplicação em prototipação. Infelizmente, não possuo mais esse projeto.",
    "ListItems":["PHP", "Java", "HTML", "CSS", "AdS", "Javascript", "MySql", "Jframe", "Pacote office", "Prototipação"]
  },
  {
    "type": "Faculdade",
    "institution": "Senac Santo Amaro",
    "date": "Graduando - 2º Semestre",
    "course": "Analise e Desenvolvimento de Sistemas",
    "description":"Fui muito relutante em decidir se faria faculdade ou não, pois ouvia frequentemente de influenciadores digitais que a faculdade não era necessária. No entanto, com o passar do tempo e ao frequentá-la, percebi que a faculdade é indispensável. Ao contrário de tentar aprender apenas por meio de cursos e autodidatismo pela internet, que não fornecem a base teórica que a faculdade oferece, agora tenho uma noção muito mais aprofundada do conhecimento que possuía antes. Isso se deve ao fato de que o conteúdo abordado é abrangente e fundamentado em uma base sólida de teoria.",
    "ListItems":[
      "Ética, Cidadania e Sustentabilidade - Ações Extensionistas",
      "Projeto Integrador: Desenvolvimento Estruturado de Sistemas",
      "Programação Web",
      "Análise e Desenvolvimento de Sistemas",
      "Bancos de Dados",
      "Algoritmos e Programação",
      "Pesquisa, Tecnologia e Sociedade",
      "Projeto Integrador: Desenvolvimento de Lógica",
      "Matemática para Tecnologia da Informação",
      "Conceitos de Computação",
      "Fundamentos de Administração"
    ]
  },
  {
    "type": "Escola Online",
    "institution": "Alura",
    "date": "2021 - Presente",
    "course": "Escola Online de Tecnologia",
    "description":"A Alura foi extremamente importante para o meu desenvolvimento na programação. Quando saí da ETEC, eu pensava que já sabia tudo, pois não tinha compreendido o quão amplo é o nosso campo de atuação. Eles me mostraram que o que eu sabia era apenas a ponta do iceberg. Os guias de estudo foram muito úteis para me orientar sobre os melhores caminhos e as melhores tecnologias a serem estudadas. Lá, pude adquirir diversos tipos de conhecimento em tecnologia, como machine learning, front-end, back-end, UX e UI design, entre muitas outras áreas.",
    "ListItems": [
      "Git e GitHub: repositório, commit e versões",
      "HTML e CSS: ambientes de desenvolvimento, estrutura de arquivos e tags",
      "HTML e CSS: cabeçalho, footer e variáveis CSS",
      "HTML e CSS: Classes, posicionamento e Flexbox",
      "HTML e CSS: trabalhando com responsividade e publicação de projetos",
      "Java 8: conheça as novidades dessa versão",
      "Java Collections: Dominando Listas, Sets e Mapas",
      "Java e java.io: Streams, Reader e Writers",
      "Java e java.lang: programe com a classe Object e String",
      "Java e java.util: Coleções, Wrappers e Lambda expressions",
      "Java e JDBC: trabalhando com um banco de dados",
      "Java Exceções: aprenda a criar, lançar e controlar exceções",
      "Java JRE e JDK: compile e execute o seu programa",
      "Java OO: entendendo a Orientação a Objetos",
      "Java Polimorfismo: entenda herança e interfaces",
      "Java Servlet: autenticação, autorização e o padrão MVC",
      "Java Servlet: programação web Java",
      "JavaScript na Web: armazenando dados no navegador",
      "JavaScript para Web: Crie páginas dinâmicas",
      "JavaScript: consumindo e tratando dados de uma API",
      "JavaScript: criando requisições",
      "JavaScript: manipulando o DOM",
      "JavaScript: métodos de array",
      "JavaScript: validações e reconhecimento de voz",
      "Maven: gerenciamento de dependências e build de aplicações Java",
      "Next.js: explorando o framework",
      "Python: avançando na linguagem",
      "Python: começando com a linguagem",
      "React: abstraindo seu CSS com Styled Components",
      "React: como os componentes funcionam",
      "React: desenvolvendo com JavaScript",
      "React: escrevendo com Typescript",
      "React: lidando com arquivos estáticos",
      "SASS: CSS sintaticamente espetacular",
      "SQL com MySQL: manipule e consulte dados",
      "TDD e Java: testes automatizados com JUnit",
      "TypeScript parte 1: evoluindo seu JavaScript",
      "TypeScript parte 2: avançando na linguagem"
    ]
  }
]